app/controllers/requests_controller.rb

SELECT * FROM `requests`
---
  def index
    @requests = Request.all

SELECT * FROM `requests` WHERE (`requests`.`id` = 1)
SELECT * FROM `appartments` WHERE (`appartments`.request_id = 5) ORDER BY created_at DESC LIMIT 0, 20
SELECT count(*) AS count_all FROM `appartments` WHERE (`appartments`.`request_id` = '5')
---
  def show
    @request = Request.find(params[:id])
    @appartments = @request.appartments.paginate :page => params[:page], :order => 'created_at DESC', :per_page => 20

INSERT INTO `requests` (`created_at`, `title`, `updated_at`) VALUES('2010-07-17 20:26:34', 'test', '2010-07-17 20:26:34')
---
  def create
    @request = Request.new(params[:request])
    url_path  = "http://realestate.nytimes.com/rentals/10036-NEW-YORK-NY-USA/0-99000000-price/0-p"
    doc = Nokogiri::HTML(open(url_path))
    total_pages =  doc.css(".input").text[/[0-9\.]+/].to_i
    if @request.save

INSERT INTO `appartments` (`price`, `sqft`, `created_at`, `title`, `bd`, `request_id`, `updated_at`, `ba`, `posted_at`) VALUES('$30,000', NULL, '2010-07-17 20:55:07', 'Clinton', '6', NULL, '2010-07-17 20:55:07', '4', '86')
---
          @appartment.sqft = sqft
          @appartment.posted_at = posted_at
          puts "------------- Page: #{i}"
          @appartment.save

SELECT * FROM `requests` WHERE (`requests`.`id` = 1)
DELETE FROM `requests` WHERE `id` = 1
---
  def destroy
    @request = Request.find(params[:id])
    @request.destroy